app/views/public/products/show.html.erb

        	<td> カテゴリー </td>
        	<td> <% @product.categories.each do |product| %>
---
SELECT "categories"."id" FROM "categories" INNER JOIN "product_categories" ON "categories"."id" = "product_categories"."category_id" WHERE "product_categories"."product_id" = ?  [["product_id", 2]]

        <p>
          <% disc.tracks.each do |track| %>
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."disc_id" = ?  [["disc_id", 7]]