app/controllers/public/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def correct_user
		@user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "name_kana" = ?, "phone" = ?, "post_code" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "zz"], ["name_kana", "zz"], ["phone", "zz"], ["post_code", "zz"], ["updated_at", "2018-10-11 11:42:49.243465"], ["id", 7]]
---
	def update
		user = User.find(params[:id])
    	user.update(user_params)