app/views/carts/show.html.erb

    <% sum = 0 %>
    <% cart = Cart.where(user_id: current_user.id).last %>
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 9], ["LIMIT", 1]]