app/views/carts/show.html.erb

          	<td> 合計 </td>
          	<td> <%= @cart_item.product.sum(:quantity) %> </td>
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]