app/controllers/carts_controller.rb

INSERT INTO "cart_items" ("cart_id", "product_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 1], ["product_id", 7], ["quantity", 10], ["created_at", "2018-10-14 12:09:49.826972"], ["updated_at", "2018-10-14 12:09:49.826972"]]
---
  def add_item
    cart_item = CartItem.new
    cart = Cart.where(user_id: current_user.id).last
    cart_item.cart_id = cart.id
    cart_item.product_id = params[:cart_id]
    cart_item.quantity = params[:product][:stock].to_i

    if cart_item.quantity > cart_item.product.stock
      @message = "在庫は" + cart_item.product.stock.to_s + "個です"
      redirect_to product_path(cart_item.product.id), alert: @message
    else
      cart_item.save

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 9], ["LIMIT", 1]]
---
  def show
  	@cart_items = CartItem.find(params[:id])
    @cart_items.cart_id = current_user.carts.where(user_id: current_user.id).last.id