app/controllers/carts_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 9], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "cart_items" ("cart_id", "product_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 1], ["product_id", 6], ["quantity", 10], ["created_at", "2018-10-14 11:43:19.038007"], ["updated_at", "2018-10-14 11:43:19.038007"]]
---
  def add_item
    cart = Cart.where(user_id: current_user.id).last
    cart_item = cart.cart_items.find_by(product_id: params[:cart_id])
    if cart_item.nil?
      cart_item = CartItem.new
      cart_item.cart_id = cart.id
      cart_item.product_id = params[:cart_id]
      quantity = params[:product][:stock].to_i
      cart_item.quantity = quantity
      product = Product.find(params[:cart_id])
      stock = product.stock
    else
      quantity = cart_item.quantity + params[:product][:stock].to_i
      cart_item.quantity = quantity
      stock = cart_item.product.stock
    end
    if quantity <= stock
         cart_item.save