app/controllers/categories_controller.rb

  def new
    @category_new = Category.new
    @category = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @category_new = Category.new(category_params)
    @category_new.save(category_params)
---
INSERT INTO "categories" ("category_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["category_name", "qqq"], ["created_at", "2018-10-13 12:05:36.546437"], ["updated_at", "2018-10-13 12:05:36.546437"]]

  def show
    @category = Category.find(params[:id])
    @products = @category.products.page(params[:page]).reverse_order
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def edit
    @category_edit = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @category_edit = Category.find(params[:id])
    @category_edit.update(category_params)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "categories" SET "category_name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["category_name", "2"], ["updated_at", "2018-10-13 12:11:52.145639"], ["id", 2]]

  def destroy
    category = Category.find(params[:id])
    category.destroy
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 1]]