app/views/admin/users/_form.html.erb

SELECT "artists".* FROM "artists"
SELECT "categories".* FROM "categories"
---
        <p>アーティスト名</p>
          <%= f.select :artist_id, Artist.all.map{|u| [u.artist_name, u.id]}, include_blank: true %>
        <p>カテゴリー</p>
          <%= f.collection_check_boxes(:category_ids, Category.all, :id, :category_name, include_hidden: false) do |b| %>