app/views/admin/users/show.html.erb

SELECT "artists".* FROM "artists"
SELECT "categories".* FROM "categories"
---
		<p>アーティスト</p><!-- 一覧から選択 -->
		<%= f.collection_select :artist, Artist.all, :id, :artist_name, include_blank: ture %>
		<p>カテゴリー</p><!-- 一覧から選択 -->
		<%= collection_check_boxes(:category, :category_ids, Category.all, :id, :category_name) do |d| %>